package Lesson_3;
//                                                   Итератор

// Получение итератора с целью более гибкой работы с данными URL. Интерфейс Iterator<E>. Итератор коллекцией. Iterator занимает
// место Enumeration в Java Collections Framework. Итераторы отличаются от перечислений двумя способами: Итераторы позволяют
// вызывающей стороне удалять элементы из базовой коллекции во время итерации с четко определенной семантикой.
// hasNext(), next(), remove()

public class Iterator {
}
