package lection_2;


public class logging {
    public static void main(String[] args) {
        // Есть определеное API которое без определеного телодвижения мжно воспользоваться даным функционалом. Логирования называют
        // также журнолирования то есть создаеться журнал ошибок
        // Логи содержат системную информацию работы программного или аппаратного комплекса. В них записываются действия разного
        // приоритетаот пользователя, или программного продукта. Процесс ведения логов называют “логированием” (журналированием).

        //                              Логирование. Использование. Основы
        // Использование
        // Logger logger = Logger.getLogger()

        // Уровни важности
        // INFO, DEBUG, ERROR, WARNING и др.

        // Вывод
        // ConsoleHandler info = new ConsoleHandler();
        // log.addHandler(info);

        // Формат вывода: структурированный, абы как*
        // XMLFormatter, SimpleFormatter
        
    }
}
