//Напишите программу, которая принимает с консоли число в формате byte и записывает его в файл ”result.txt”.
package Seminar_2;



public class Task0 {
    public static void main(String[] args) {
        double x = 8.5;
        System.out.println(x);
      }
    
}
